{
    "projects": [
        {
            "id": "tmv",
            "title": "Team Structure Visualisation",
            "description": [
                "A dynamic and responsive internal frontend tool to visualise and explore complex agile team structures across a 200k+ employee organisation.",
                "It has both graph and list views, the latter elevated and optimised for mobile.",
                "This was a greenfield project, and it was very rewarding work to build a very complex app from scratch in close collaboration with designers, stakeholders and backend.",
                "Through this app it became easier for any Woolworths employee to view and explore their own or others teams and their connection within the organisation, not only in a static org chart.",
                "Due to this being an internal corporate page, no live demo is available. Check out the video below!"
            ],
            "media": [
                {
                    "title": "Video Demo: TeamView Visualisation",
                    "type": "video",
                    "src": "./tmvDemo.mp4"
                }
            ],
            "year": [
                2023,
                2024,
                2025
            ],
            "framework": [
                "Lit"
            ],
            "language": [
                "Typescript"
            ],
            "library": [
                "d3"
            ],
            "workplace": "Woolworths Group",
            "featured": true,
            "motivation": "work"
        },
        {
            "id": "wflw",
            "title": "Workflows",
            "description": [
                "Automated workflows for requesting and approving structural changes to teams or members, replacing manual email/spreadsheet-based business processes.",
                "This was developed in conjunction with an admin portal to list and take action on those workflows, and a detailed view of the workflows to facilitate actions for authorised team members. The detail page and admin portal have real-time updates via polling.",
                "This feature greatly reduced human errors and significantly improving process efficiency and visibility."
            ],
            "media": [
                {
                    "title": "Video Demo: Workflows",
                    "type": "video",
                    "src": "./workflowDemo.mp4"
                }
            ],
            "year": [
                2024
            ],
            "framework": [
                "Lit"
            ],
            "language": [
                "Typescript"
            ],
            "library": [],
            "workplace": "Woolworths Group",
            "motivation": "work"
        },
        {
            "id": "wds",
            "title": "Design System Components",
            "description": [
                "During my time at Woolworths Group I contributed to the internal Design System for use across platforms with consistency.",
                "The components are written in highly performant Lit, with a focus on reusability and scalability. Many of them make use of the web components slot mechanic and avoid passing in complex structures as properties in order to maintain ease of use and serialisability.",
                "Storybook as a tool has been invaluable to develop robust components and the aim was to, along with unit tests, cover all the different states a component can be in."
            ],
            "media": [
                {
                    "title": "Screenshot of design system in Storybook",
                    "type": "image",
                    "src": "./designSystem.png"
                }
            ],
            "year": [
                2023,
                2024,
                2025
            ],
            "framework": [
                "Lit"
            ],
            "language": [
                "Typescript"
            ],
            "library": [],
            "workplace": "Woolworths Group",
            "featured": true,
            "motivation": "work"
        },
        {
            "id": "reporting",
            "title": "Reporting pages",
            "description": [
                "Developed a versatile framework to show filterable reports in a table. By maintaining a strict separation of concerns, the underlying structure will display one or more tables along with filters - without any domain knowledge.",
                "Two views exist that access different backend APIs to show different kinds of data."
            ],
            "media": [],
            "year": [
                2025
            ],
            "framework": [
                "Lit"
            ],
            "language": [
                "Typescript"
            ],
            "library": [],
            "workplace": "Woolworths Group",
            "motivation": "work"
        },
        {
            "id": "diversity",
            "title": "MultiViz - Visualising diversity and liveability in Australian Cities, Vancouver and Auckland",
            "description": [
                "This tool provides valuable insight of diversity in cities.",
                "Using Mapbox and the curated dataset (between 20 and 30 MB), a multitude of diversity or liveability indices, such as ethnic, income, gender diversity are mapped to the neighbourhoods of the cities.",
                "There are multiple dimensions to be mapped to visual channels there, such as the colour of the map, but also bars that are rendered on top - height, width and colour of those bars can be mapped to parameters as well.",
                "By hovering over the colours in the menu, the visualisation updates immediately, and one can interact with the bars or apply filters in the menu."
            ],
            "url": [
                {
                    "title": "MultiViz Urban Diversity",
                    "type": "website",
                    "src": "https://app.urbandiversity.cloud.edu.au/"
                }
            ],
            "media": [
                {
                    "title": "Screenshot of MultiViz",
                    "type": "image",
                    "src": "./diversity.png"
                }
            ],
            "year": [
                2021,
                2022
            ],
            "framework": [
                "ReactJS"
            ],
            "language": [
                "Javascript"
            ],
            "library": [
                "MapBox",
                "MaterialUI",
                "d3"
            ],
            "workplace": "Monash Data Science and AI Platform",
            "featured": true,
            "motivation": "work"
        },
        {
            "id": "imp",
            "title": "IMP - Integrated Microscopy and Electronics",
            "description": [
                "An ARDC project in close collaboration with Electron Microscopy at Monash University. I extended an existing framework, Neuroglancer, to be able to show a differenc kind of data and customise it",
                "Neuroglancer is a powerful, WebGL-based viewer for volumetric data, primarily used in neuroscience to visualize extremely large 3D datasets like electron microscopy images of brains. The EM datsets are different and I also set up a pipeline in Python to convert them to the correct format.",
                "In addition, I tweaked the menu and added more functionalities, such as being able to filter objects in the renderer, colour them in different colours or assign them to custom groups to toggle on and off.",
                "Lastly I built a ReactJS portal page, incorporating OAuth, for dataset selection."
            ],
            "url": [
                {
                    "title": "DOI on bridges Monash",
                    "type": "doi",
                    "src": "https://bridges.monash.edu/articles/code/IMP_Integrated_Microscopy_and_Proteomics_-_Application_and_Frontend/23357999"
                },
                {
                    "title": "Git Repository",
                    "type": "git",
                    "src": "https://github.com/DeMarcoLab/IMP"
                }
            ],
            "media": [],
            "year": [
                2022
            ],
            "framework": [
                "Neuroglancer",
                "ReactJS"
            ],
            "language": [
                "Typescript",
                "Python",
                "Javascript"
            ],
            "library": [],
            "workplace": "Monash Data Science and AI Platform",
            "motivation": "work"
        },
        {
            "id": "ge3",
            "title": "Global Encounters",
            "description": [
                "Contributed frontend features to Global Encounters, an interactive digital humanities project exploring 1000 years of coastal interactions in Australia."
            ],
            "url": [
                {
                    "title": "Global Encounters",
                    "type": "website",
                    "src": "https://globalencounters.net/"
                }
            ],
            "media": [],
            "year": [
                2022
            ],
            "framework": [
                "ReactJS"
            ],
            "language": [
                "Javascript"
            ],
            "library": [
                "MaterialUI"
            ],
            "workplace": "Monash Data Science and AI Platform",
            "motivation": "work"
        },
        {
            "id": "trust",
            "title": "Trust Experiment",
            "description": [
                "A web-based card game incorporating AI advice logic to enable research on trust in AI agent based systems",
                "The users had to play the game, while getting alerts about an aged care facility, and had to decide whether to react or not, with an agent giving advice.",
                "The backend was a Google Sheet. Researchers had several sheets for different scenarios."
            ],
            "url": [
                {
                    "title": "Trust Experiment 1",
                    "type": "publication",
                    "src": "https://link.springer.com/chapter/10.1007/978-3-319-75931-9_12"
                },
                {
                    "title": "Trust Experiment 2",
                    "type": "publication",
                    "src": "https://link.springer.com/chapter/10.1007/978-3-319-75931-9_12"
                }
            ],
            "media": [],
            "year": [
                2019
            ],
            "framework": [
                "KnockoutJS"
            ],
            "language": [
                "Javascript"
            ],
            "library": [],
            "workplace": "Monash Immersive Visualisation Platform",
            "motivation": "work"
        },
        {
            "id": "workshop",
            "title": "Introductory workshop for Frontend Vis",
            "description": [
                "Conceptualised, designed and delivered a workshop for introductory web visualisation. This included interactive exercises, live CodePen demos, and slide content.",
                "The participants learned step by step how to create a simple visualisation of provided data, using ChartJS."
            ],
            "url": [
                {
                    "title": "Visualisation and Storytelling",
                    "type": "code and data",
                    "src": "https://figshare.com/articles/software/_/13100510"
                }
            ],
            "media": [],
            "year": [
                2020
            ],
            "framework": [
                "ReactJS"
            ],
            "language": [
                "Javascript"
            ],
            "library": [
                "ChartJS"
            ],
            "workplace": "Monash Data Science and AI Platform",
            "motivation": "work"
        },
        {
            "id": "agent",
            "title": "Agent Simulation",
            "description": [
                "Simulated student movement scenarios for campus planning using ECS in Unity. Real student schedule data was used to approximate the targets of the agents.",
                "It was possible to add an obstacle on a path to observe the change of pathfinding for the agents."
            ],
            "url": [],
            "media": [
                {
                    "type": "video",
                    "src": "./campusSim.mp4",
                    "title": "Campus Simulation"
                }
            ],
            "year": [
                2019
            ],
            "framework": [
                "Unity",
                "ECS"
            ],
            "language": [
                "C#"
            ],
            "library": [],
            "workplace": "Monash Immersive Visualisation Platform",
            "motivation": "work"
        },
        {
            "id": "scrollyteller",
            "title": "Scrollyteller",
            "description": [
                "Inspired by the at the time rising popularity of scrollytellers, I played around with a system to allow users to add their content via JSON and generate a scrollyteller.",
                "The idea was that other parameters, such as locations on a map, display of a certain image or video, could be linked to positions of the scroll.",
                "It is unfinished, but check out the proof of concept using public Australian power production data below"
            ],
            "url": [
                {
                    "title": "Australian Energy production distribution over the years",
                    "type": "website",
                    "src": "https://norahamacher.github.io/aussieElectro/"
                }
            ],
            "media": [],
            "year": [
                2019
            ],
            "framework": [
                "ReactJS"
            ],
            "language": [
                "Javascript"
            ],
            "library": [
                "MapBox",
                "ChartJS"
            ],
            "motivation": "private"
        }
    ]
}